---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.GetPresentationMode(Autodesk.Revit.DB.View)
zh: 钢筋、配筋
source: html/7f5691ab-c03a-ed42-bf23-aa0a0d849262.htm
---
# Autodesk.Revit.DB.Structure.Rebar.GetPresentationMode Method

**中文**: 钢筋、配筋

Gets the presentation mode for this rebar set when displayed in the given view.

## Syntax (C#)
```csharp
public RebarPresentationMode GetPresentationMode(
	View dBView
)
```

## Parameters
- **dBView** (`Autodesk.Revit.DB.View`) - The view.

## Returns
The presentation mode.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null